; domain
;; Woodworking
;;

(define (domain woodworking-loop)
  (:requirements :typing :action-costs)
  (:types
   ;; 色、木材種別、木材、機械
   acolour awood woodobj machine 
   ;; 表面状態 ワニスなどの状態
   surface treatmentstatus
   ;; 板のサイズ規格、パーツサイズ規格
   apartsize - object
   highspeed-saw glazer grinder immersion-varnisher
   planer saw spray-varnisher - machine
   board part - woodobj)

  (:constants
   verysmooth smooth rough - surface
   ;; ニス、光ってる、なにもされてない、色がついてる?
   varnished glazed untreated colourfragments - treatmentstatus
   ;; 色
   natural - acolour
   small medium large - apartsize)

  (:predicates
   ;; 切り出されていない。
   (unused ?obj - part)
   ;; 機械の中に入っておらず、または切り出されており、手で操作することができる。
   (available ?obj - woodobj)

   (surface-condition ?obj - woodobj ?surface - surface)
   (treatment ?obj - part ?treatment - treatmentstatus)
   (colour ?obj - part ?colour - acolour)

   ;; 木の種類。
   (wood ?obj - woodobj ?wood - awood)
   (goalsize ?p - part ?size - apartsize)

   (in-highspeed-saw ?b - board ?m - highspeed-saw)
   (empty ?m - highspeed-saw)
   ;; 機械に装填されている塗料の色
   (has-colour ?machine - machine ?colour - acolour)
   (contains-part ?b - board ?p - part)
   ;; grindによる順序を規定
   (grind-treatment-change ?old ?new - treatmentstatus)
   (is-smooth ?surface - surface))
  
  (:functions (total-cost) - number
              (spray-varnish-cost ?obj - part) - number
              (glaze-cost ?obj - part) - number
              (grind-cost ?obj - part) - number
              (plane-cost ?obj - part) - number)

  ;; immersion: (液体に)浸すこと.
  ;; varnish : ニス，ワニス.
  ;; 浸すことによって塗装+ニス。
  ;; 大きさによってコストが変わらないみたいだ。
  ;; smooth でないといけない。
  (:action do-immersion-varnish
           :parameters (?x - part ?m - immersion-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and
                    (increase (total-cost) 10) ;; コスト固定
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; スプレーによって塗装+ニス。
  ;; 効果は do-immersion-varnish と同じ。
  ;; smooth でないといけない。
  (:action do-spray-varnish
           :parameters (?x - part ?m - spray-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (spray-varnish-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  

  ;;〈紙・布・皮などに〉光滑剤を塗る，つやつけをする.
  ;; smooth でなくてもいい。色+glazed状態
  (:action do-glaze
           :parameters (?x - part ?m - glazer 
                           ?newcolour - acolour)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (glaze-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x glazed)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; 削ってverysmoothに。塗装をやり直し。色は消える。
  ;; 表面は grind-treatment-change に従って順番に変化していく。
  (:action do-grind
           :parameters (?x - part ?m - grinder ?oldsurface - surface
                           ?oldcolour - acolour 
                           ?oldtreatment ?newtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (is-smooth ?oldsurface)
                          (colour ?x ?oldcolour)
                          (treatment ?x ?oldtreatment)
                          (grind-treatment-change ?oldtreatment ?newtreatment))
           :effect (and
                    (increase (total-cost) (grind-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x verysmooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x ?newtreatment)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; 削ってsmoothに。
  (:action do-plane
           :parameters (?x - part ?m - planer ?oldsurface - surface
                           ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (treatment ?x ?oldtreatment)
                          (colour ?x ?oldcolour))
           :effect (and
                    (increase (total-cost) (plane-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x smooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x untreated)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; のこぎりで切る機械に入れる。
  (:action load-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (and
                          (empty ?m)
                          (available ?b))
           :effect (and
                    (increase (total-cost) 30)
                    (not (available ?b))
                    (not (empty ?m))
                    (in-highspeed-saw ?b ?m)))
  
  ;; のこぎりで切る機械から取り出す。
  (:action unload-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (in-highspeed-saw ?b ?m)
           :effect (and
                    (increase (total-cost) 10)
                    (available ?b)
                    (not (in-highspeed-saw ?b ?m))
                    (empty ?m)))
  
  ;; のこぎり機械に入っている場合、小さく切る。
  ;; do-saw-small と違って、時間は10しかかからない。
  ;; 
  (:action cut-board-small
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p small)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)))

  ;; 中くらいに切る。
  (:action cut-board-medium
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p medium)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)))

  (:action cut-board-large
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p large)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)))

  ;; 手で板を切り出す。板が大きかろうが小さかろうが30かかる
  ;; 板の大きさは小さくなる。(size_after になる)
  ;; ここらへんは do-saw-small/medium/large全部同じ。
  ;; largeを切りだそうとすると板が3段階小さくなる。
  (:action do-saw-small
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p small)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)))

  (:action do-saw-medium
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p medium)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)))

  (:action do-saw-large
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p large)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)))
  )

; problem
(DEFINE (PROBLEM WOOD-LOOP-4) (:DOMAIN WOODWORKING-LOOP)
 (:OBJECTS GRINDER-0 - GRINDER GLAZER-0 - GLAZER IMMERSION-VARNISHER-0 -
  IMMERSION-VARNISHER PLANER-0 - PLANER HIGHSPEED-SAW-0 - HIGHSPEED-SAW
  SPRAY-VARNISHER-0 - SPRAY-VARNISHER SAW-0 - SAW COLOR-0 COLOR-1 COLOR-2 -
  ACOLOUR WOOD-0 WOOD-1 WOOD-2 - AWOOD PART-0 PART-1 PART-2 PART-3 - PART
  BOARD-0 BOARD-1 BOARD-2 - BOARD)
 (:INIT (GRIND-TREATMENT-CHANGE VARNISHED COLOURFRAGMENTS)
  (GRIND-TREATMENT-CHANGE GLAZED UNTREATED)
  (GRIND-TREATMENT-CHANGE UNTREATED UNTREATED)
  (GRIND-TREATMENT-CHANGE COLOURFRAGMENTS UNTREATED) (IS-SMOOTH SMOOTH)
  (IS-SMOOTH VERYSMOOTH) (= (TOTAL-COST) 0)
  (HAS-COLOUR IMMERSION-VARNISHER-0 COLOR-0)
  (HAS-COLOUR SPRAY-VARNISHER-0 COLOR-1) (HAS-COLOUR GLAZER-0 COLOR-2)
  (EMPTY HIGHSPEED-SAW-0) (AVAILABLE PART-0) (COLOUR PART-0 COLOR-1)
  (WOOD PART-0 WOOD-0) (SURFACE-CONDITION PART-0 ROUGH)
  (TREATMENT PART-0 VARNISHED) (GOALSIZE PART-0 SMALL)
  (= (SPRAY-VARNISH-COST PART-0) 5) (= (GLAZE-COST PART-0) 10)
  (= (GRIND-COST PART-0) 15) (= (PLANE-COST PART-0) 10) (AVAILABLE PART-1)
  (COLOUR PART-1 COLOR-1) (WOOD PART-1 WOOD-0) (SURFACE-CONDITION PART-1 ROUGH)
  (TREATMENT PART-1 VARNISHED) (GOALSIZE PART-1 SMALL)
  (= (SPRAY-VARNISH-COST PART-1) 5) (= (GLAZE-COST PART-1) 10)
  (= (GRIND-COST PART-1) 15) (= (PLANE-COST PART-1) 10) (AVAILABLE PART-2)
  (COLOUR PART-2 COLOR-1) (WOOD PART-2 WOOD-0) (SURFACE-CONDITION PART-2 ROUGH)
  (TREATMENT PART-2 VARNISHED) (GOALSIZE PART-2 SMALL)
  (= (SPRAY-VARNISH-COST PART-2) 5) (= (GLAZE-COST PART-2) 10)
  (= (GRIND-COST PART-2) 15) (= (PLANE-COST PART-2) 10) (AVAILABLE PART-3)
  (COLOUR PART-3 COLOR-1) (WOOD PART-3 WOOD-0) (SURFACE-CONDITION PART-3 ROUGH)
  (TREATMENT PART-3 VARNISHED) (GOALSIZE PART-3 SMALL)
  (= (SPRAY-VARNISH-COST PART-3) 5) (= (GLAZE-COST PART-3) 10)
  (= (GRIND-COST PART-3) 15) (= (PLANE-COST PART-3) 10) (WOOD BOARD-0 WOOD-0)
  (SURFACE-CONDITION BOARD-0 ROUGH) (AVAILABLE BOARD-0) (WOOD BOARD-1 WOOD-1)
  (SURFACE-CONDITION BOARD-1 ROUGH) (AVAILABLE BOARD-1) (WOOD BOARD-2 WOOD-2)
  (SURFACE-CONDITION BOARD-2 ROUGH) (AVAILABLE BOARD-2))
 (:GOAL
  (AND (COLOUR PART-0 COLOR-0) (AVAILABLE PART-0)
       (SURFACE-CONDITION PART-0 VERYSMOOTH) (COLOUR PART-1 COLOR-0)
       (AVAILABLE PART-1) (SURFACE-CONDITION PART-1 VERYSMOOTH)
       (COLOUR PART-2 COLOR-0) (AVAILABLE PART-2)
       (SURFACE-CONDITION PART-2 VERYSMOOTH) (COLOUR PART-3 COLOR-0)
       (AVAILABLE PART-3) (SURFACE-CONDITION PART-3 VERYSMOOTH)))
 (:METRIC MINIMIZE (TOTAL-COST)))

; plan
1. (do-plane part-3 planer-0 rough color-1 varnished)
   deleted: (surface-condition part-3 rough) (treatment part-3 varnished) (colour part-3 color-1)
   added: (surface-condition part-3 smooth) (treatment part-3 untreated) (colour part-3 natural)
   goals met: 4 of 12
2. (do-plane part-2 planer-0 rough color-1 varnished)
   deleted: (surface-condition part-2 rough) (treatment part-2 varnished) (colour part-2 color-1)
   added: (surface-condition part-2 smooth) (treatment part-2 untreated) (colour part-2 natural)
   goals met: 4 of 12
3. (do-plane part-1 planer-0 rough color-1 varnished)
   deleted: (surface-condition part-1 rough) (treatment part-1 varnished) (colour part-1 color-1)
   added: (surface-condition part-1 smooth) (treatment part-1 untreated) (colour part-1 natural)
   goals met: 4 of 12
4. (do-plane part-0 planer-0 rough color-1 varnished)
   deleted: (surface-condition part-0 rough) (treatment part-0 varnished) (colour part-0 color-1)
   added: (surface-condition part-0 smooth) (treatment part-0 untreated) (colour part-0 natural)
   goals met: 4 of 12
5. (do-grind part-3 grinder-0 smooth natural untreated untreated)
   deleted: (surface-condition part-3 smooth)
   added: (surface-condition part-3 verysmooth)
   goals met: 5 of 12
6. (do-immersion-varnish part-3 immersion-varnisher-0 color-0 verysmooth)
   deleted: (treatment part-3 untreated) (colour part-3 natural)
   added: (treatment part-3 varnished) (colour part-3 color-0)
   goals met: 6 of 12
7. (do-grind part-2 grinder-0 smooth natural untreated untreated)
   deleted: (surface-condition part-2 smooth)
   added: (surface-condition part-2 verysmooth)
   goals met: 7 of 12
8. (do-immersion-varnish part-2 immersion-varnisher-0 color-0 verysmooth)
   deleted: (treatment part-2 untreated) (colour part-2 natural)
   added: (treatment part-2 varnished) (colour part-2 color-0)
   goals met: 8 of 12
9. (do-grind part-1 grinder-0 smooth natural untreated untreated)
   deleted: (surface-condition part-1 smooth)
   added: (surface-condition part-1 verysmooth)
   goals met: 9 of 12
10. (do-immersion-varnish part-1 immersion-varnisher-0 color-0 verysmooth)
   deleted: (treatment part-1 untreated) (colour part-1 natural)
   added: (treatment part-1 varnished) (colour part-1 color-0)
   goals met: 10 of 12
11. (do-grind part-0 grinder-0 smooth natural untreated untreated)
   deleted: (surface-condition part-0 smooth)
   added: (surface-condition part-0 verysmooth)
   goals met: 11 of 12
12. (do-immersion-varnish part-0 immersion-varnisher-0 color-0 verysmooth)
   deleted: (treatment part-0 untreated) (colour part-0 natural)
   added: (treatment part-0 varnished) (colour part-0 color-0)
   goals met: 12 of 12
